# 1. Напишите функцию расчет_площади_треугольника(), которая
# принимает длины основания и высоту треугольника в качестве аргументов и
# возвращает его площадь. Затем вызовите функцию с различными значениями
# основания и высоты треугольника

def calculate_triangle_area(base, height):
    return 0.5 * base * height

print(calculate_triangle_area(5, 3))
print(calculate_triangle_area(10, 6))
print(calculate_triangle_area(15, 9))
